#### STLExportOptions Members

---

|  |
| --- |
| STLExportOptions Class   Constructors   Methods   Properties   See Also |

The  STLExportOptions  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | STLExportOptions | Constructs a new instance of STLExportOptions with default values of all properties. |
| Public method | STLExportOptions(ExportResolution) | Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values. |
| Public method | STLExportOptions(STLExportResolution) | **Obsolete.**   Constructs a new instance of STLExportOptions with all predefined tessellation settings, depending on STL export resolution type. Note: in case of Custom resolution type, tessellation settings won't be predefined and will have default values. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  ATFBaseExportOptions  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | IsGridAspectRatioSet | Checks whether the GridAspectRatio tessellation parameter is explicitly set. |
| Public method | IsMaxEdgeLengthSet | Checks whether the MaxEdgeLength tessellation parameter is explicitly set. |
| Public method | IsNormalToleranceSet | Checks whether the NormalTolerance tessellation parameter is explicitly set. |
| Public method | IsSurfaceToleranceSet | Checks whether the SurfaceTolerance tessellation parameter is explicitly set. |
| Public method Static member | IsValidForGridAspectRatio | Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter. |
| Public method Static member | IsValidForMaxEdgeLength | Checks whether the value is allowed (is in the allowed range) for MaxEdgeLength tessellation parameter. |
| Public method Static member | IsValidForNormalTolerance | Checks whether the value is allowed (is in the allowed range) for NormalTolerance tessellation parameter. |
| Public method Static member | IsValidForSurfaceTolerance | Checks whether the value is allowed (is in the allowed range) for SurfaceTolerance tessellation parameter. |
| Public method | SetTessellationSettings(ExportResolution) | Sets all the tessellation parameters to its predefined values for the given resolution type. |
| Public method | SetTessellationSettings(STLExportResolution) | **Obsolete.**   Sets all the tessellation parameters to its predefined values for the given resolution type. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | ExportBinary | True to export in binary STL format, false to export in ASCII STL format. Default value is true. |
| Public property | ExportColor | True to export color information, false otherwise. Default value is false. |
| Public property | GridAspectRatio | The maximum aspect ratio allowed in the grid placed across the face. The minimum allowed value is 1.0. The maximum allowed value is 10.0. By default this property is ignored. |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  ATFBaseExportOptions  .) |
| Public property | MaxEdgeLength | The maximum length allowed for any chord on an edge or between any two adjacent grid lines. This is a percentage value. By exporting, the real value of maximum edge length is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.1%. The maximum allowed value is 10.0%. By default this property is ignored. |
| Public property | NormalTolerance | The maximum change in the surface normal between adjacent nodes in the mesh. This property is defined in degrees. The minimum allowed value is 1.0 degrees. The maximum allowed value is 45.0 degrees. Default value is 15.0 degrees. |
| Public property | SurfaceTolerance | The maximum distance between mesh triangles and model geometry. This is a percentage value. By exporting, the real value of surface tolerance is calculated as a percent from the length of the diameter of the body bounding box. The minimum allowed value is 0.001%. The maximum allowed value is 1.0%. Default value is 0.1%. |
| Public property | TargetUnit | The unit type of geometry in the resultant STL file. Default value is ExportUnit::Default. |
| Public property | ViewId | The element id of the 3D view to export. InvalidElementId by default. (Inherited from  ATFBaseExportOptions  .) |

# See Also

STLExportOptions Class

Autodesk.Revit.DB Namespace